ecomm_api/app/controllers/cartitems_controller.rb

SELECT "cartitems".* FROM "cartitems"
---
  def index
    @cartitems = Cartitem.all

INSERT INTO "cartitems" ("quantity", "created_at", "updated_at", "usercart_id", "product_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["quantity", 1], ["created_at", "2019-12-18 23:15:17.277227"], ["updated_at", "2019-12-18 23:15:17.277227"], ["usercart_id", 11], ["product_id", 2]]
---
  def create
    @cartitem = Cartitem.new(cartitem_params)
    @cartitem.product_id = params[:product_id]
    @cartitem.usercart_id = params[:usercart_id]

    if @cartitem.save

UPDATE "cartitems" SET "quantity" = $1, "updated_at" = $2 WHERE "cartitems"."id" = $3  [["quantity", 20], ["updated_at", "2019-12-19 19:49:06.908093"], ["id", 41]]
---
  def update
    if @cartitem.update(cartitem_params)

DELETE FROM "cartitems" WHERE "cartitems"."id" = $1  [["id", 19]]
---
  def destroy
    @cartitem.destroy

SELECT "cartitems".* FROM "cartitems" WHERE "cartitems"."id" = $1 LIMIT $2  [["id", 19], ["LIMIT", 1]]
---
    def set_cartitem
      @cartitem = Cartitem.find(params[:id])