ecomm_api/app/controllers/usercarts_controller.rb

SELECT "usercarts".* FROM "usercarts"
---
  def index
    @usercarts = Usercart.all

INSERT INTO "usercarts" ("last_accessed_date", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["last_accessed_date", "2019-12-18"], ["created_at", "2019-12-18 23:15:11.556300"], ["updated_at", "2019-12-18 23:15:11.556300"], ["user_id", 33]]
---
  def create
    @usercart = Usercart.new(usercart_params)
    @usercart.user_id = params[:user_id]
    puts @usercart.user_id

    if @usercart.save

SELECT "usercarts".* FROM "usercarts" WHERE "usercarts"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]
---
    def set_usercart
      @usercart = Usercart.find(params[:id])