ecomm_api/app/controllers/usercarts_controller.rb

SELECT "usercarts".* FROM "usercarts" WHERE "usercarts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_usercart
      @usercart = Usercart.find(params[:id])