ecomm_api/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."username" = $1  [["username", "aman"]]
SELECT 1 AS one FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "aman"], ["LIMIT", 1]]
SELECT "users".* FROM "users"
---
  def index

# puts params[:username]

    if params[:username]
      # @users = User.exists?(username: params[:username])
      found = User.exists?(username: params[:username])

      if found
          @user = User.where(username: params[:username])
          # user_details = {
          #   id : @user.id,
          #   username : @user.username,
          #   email : @user.email
          # }
          render json:  @user, status: 200

      else
        # res = {status: "400"}
          render json: @user, status: 400
          end

      # render json: @users

    else
      @users = User.all

SELECT "usercarts".* FROM "usercarts" WHERE "usercarts"."user_id" = $1 ORDER BY "usercarts"."id" ASC LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
SELECT "cartitems".* FROM "cartitems" WHERE "cartitems"."usercart_id" = $1  [["usercart_id", 1]]
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
      user_carts = @user.usercarts
      user_cartsid = @user.usercarts.first

      user_items = user_cartsid.cartitems

      productslist2 = []

      user_items.each { |id|
      puts " id #{id}"
    puts id.product_id
     prod_id =  id.product_id
    puts Product.find(prod_id)
    puts Product.find(prod_id).name
    puts Product.find(prod_id).category

    singleprod = { id: id.id, user_quantity: id.quantity, product_id: id.product_id,  name:  Product.find(prod_id).name, category:  Product.find(prod_id).category,
    price:  Product.find(prod_id).price, quantity:  Product.find(prod_id).quantity_instock

INSERT INTO "users" ("username", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", "ttttt"], ["password", "ttttt"], ["created_at", "2019-12-19 02:40:05.546054"], ["updated_at", "2019-12-19 02:40:05.546054"]]
---
  def create
    @user = User.new(user_params)

    if @user.save