app/controllers/users_controller.rb

SELECT "usercarts".* FROM "usercarts" WHERE "usercarts"."user_id" = $1 ORDER BY "usercarts"."id" ASC LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
SELECT "cartitems".* FROM "cartitems" WHERE "cartitems"."usercart_id" = $1  [["usercart_id", 3]]
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "cartitems".* FROM "cartitems" WHERE "cartitems"."usercart_id" = $1  [["usercart_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def show
      user_carts = @user.usercarts
      user_cartsid = @user.usercarts.first

      user_items = user_cartsid.cartitems

      productslist2 = []

      user_items.each { |id|
      puts " id #{id}"
    puts id.product_id
     prod_id =  id.product_id
    puts Product.find(prod_id)
    puts Product.find(prod_id).name
    puts Product.find(prod_id).category

    singleprod = { id: id.id, user_quantity: id.quantity, product_id: id.product_id,  name:  Product.find(prod_id).name, category:  Product.find(prod_id).category,
    price:  Product.find(prod_id).price, quantity:  Product.find(prod_id).quantity_instock